{
  "pkg_name": "com.philips.da.philipsrobot",
  "appId": "com.philips.da.philipsrobot",
  "title": "Philips HomeRun Robot App",
  "developer": "Versuni Netherlands B.V.",
  "developer_id": "Versuni+Netherlands+B.V.",
  "developer_email": "Homerun@versuni.com",
  "developer_website": null,
  "developer_address": null,
  "category": "House & Home",
  "category_id": "HOUSE_AND_HOME",
  "content_rating": "Everyone",
  "score": 4.4166665,
  "ratings": 9834,
  "reviews_count": 4,
  "installs": "100,000+",
  "free": true,
  "price": 0,
  "currency": "USD",
  "offers_iap": false,
  "contains_ads": false,
  "privacy_policy": "https://qin.tuyacn.com/app-agreement/en/1513101859/v1.0.1/1/smart/app/package/1513101859/privacyUrl_1677061620627.html",
  "size_mb": null,
  "min_android_version": null,
  "description": "Unlock the full potential of your Philips HomeRun robot. Tell it exactly how and when to clean each room and mow your lawn. Then, relax.\r\n \r\nWith the Philips HomeRun Robot app you can:\r\n● Start, pause or stop cleaning and mowing remotely\r\n● Make a precise map of your home to clean each room in no time\r\n● Control where your robot cleans and mows\r\n● Choose a cleaning mode per room and mowing mode per lawn\r\n● Set up once, enjoy spotless floors and lawns daily\r\n● Custom clean and mow for specific situations\r\n● Get step-by-step guidance to set up easily\r\n● Receive progress updates on each clean and mow\r\n● Keep your data secure\r\n \r\nStart, pause or stop your robot remotely\r\nCome home to clean floors and a perfect-looking garden every day by using your Philips HomeRun vacuum, mop, and lawn mowing robot in combination with the app. Set it up once—to clean each room and mow your lawn just the way you like it—touch ‘Start’, anytime, anywhere, and let your robot do the rest.\r\nOn its first run, your robot will map your floor plan and garden. Now you have an interactive map of your home that you can use to tell your robot how and when to clean each room or to monitor how your lawn is mowed. The robot vacuum cleaner can store up to five maps.\r\n \r\nControl where your robot vacuum cleaner cleans\r\nOnly want your robot to clean the kitchen, bathroom, living room? With the app, you can tell your robot which rooms you want cleaned, and in what order. If there are areas or things you’d like it to avoid—like precious items or a rug in an area you want to mop—you can tell it where not to go, or not to mop, as well.\r\n\r\nChoose a cleaning mode for each room and mowing mode for each lawn\r\nGive each room unique attention with one of the cleaning modes and mowing modes for your lawn. Use Dry mode to vacuum the bedroom and Wet & Dry mode to vacuum and mop hard floors. Put your robot on Quiet mode if, say, you have a meeting, or give the kitchen an extra thorough clean by using Intensive mode. Choose a mowing mode for your lawn to get the perfect looking garden.\r\n \r\nSet up once. Enjoy spotless floors and lawns every day\r\nOnce you’ve created a cleaning and mowing plan, clean floors and perfectly mowed lawns are always a tap away. Tap ‘Start’ when you want your robot to begin - every day if you like, and at a time that suits your schedule.\r\n \r\nCustom clean for specific situations\r\nHad friends over and need an extra thorough clean? Or maybe the dog left paw prints in your hallway. Again. Schedule a custom clean and mow that targets specific rooms, areas.\r\n \r\nGet step-by-step guidance to setup easily\r\nFrom connecting to Wi-Fi to the first clean and mow, we’ll guide you through every step of getting started. You’ll find easy-to-follow instructions and how-to-videos as well.\r\n \r\nAlways have support at your fingertips\r\nHave extra questions about the HomeRun app and robot? You’ll find a user manual in the app, answers to FAQs and easy access to Customer Care if need be.\r\n \r\nReceive progress updates\r\nAs your robot cleans and mows, you’ll receive in-app updates. See where your robot currently is in your home and what the robot mowing progress is in your garden. Check on its battery levels and, most importantly, get notified as soon as the cleaning run or mowing is done \r\n \r\nMaintain high performance\r\nGet the best performance from your robot by replacing parts on time. Our app lets you know when it’s time to replace parts like filters, mops, and blades, and makes it easy to order them.\r\n \r\nKeep your data secure\r\nPhilips adheres to a strict privacy policy. We recommend creating an account to ensure you can save your preferences. If you prefer, you can use the app as a guest. \r\n \r\nWiFi\r\nPhilips HomeRun robot vacuum cleaners have dual band Wi-Fi so they are easy to connect to your home Wi-Fi, whether it's to 2.4 or 5.0GHz. Robot lawn mowers only connect to your 2.4GHz home Wi-Fi.\r\n \r\nNeed help?\r\nVisit www.Philips.com to find answers to our most frequently asked questions, or get in touch with our Consumer Care team.",
  "descriptionHTML": "Unlock the full potential of your Philips HomeRun robot. Tell it exactly how and when to clean each room and mow your lawn. Then, relax.<br> <br>With the Philips HomeRun Robot app you can:<br>● Start, pause or stop cleaning and mowing remotely<br>● Make a precise map of your home to clean each room in no time<br>● Control where your robot cleans and mows<br>● Choose a cleaning mode per room and mowing mode per lawn<br>● Set up once, enjoy spotless floors and lawns daily<br>● Custom clean and mow for specific situations<br>● Get step-by-step guidance to set up easily<br>● Receive progress updates on each clean and mow<br>● Keep your data secure<br> <br>Start, pause or stop your robot remotely<br>Come home to clean floors and a perfect-looking garden every day by using your Philips HomeRun vacuum, mop, and lawn mowing robot in combination with the app. Set it up once—to clean each room and mow your lawn just the way you like it—touch ‘Start’, anytime, anywhere, and let your robot do the rest.<br>On its first run, your robot will map your floor plan and garden. Now you have an interactive map of your home that you can use to tell your robot how and when to clean each room or to monitor how your lawn is mowed. The robot vacuum cleaner can store up to five maps.<br> <br>Control where your robot vacuum cleaner cleans<br>Only want your robot to clean the kitchen, bathroom, living room? With the app, you can tell your robot which rooms you want cleaned, and in what order. If there are areas or things you’d like it to avoid—like precious items or a rug in an area you want to mop—you can tell it where not to go, or not to mop, as well.<br><br>Choose a cleaning mode for each room and mowing mode for each lawn<br>Give each room unique attention with one of the cleaning modes and mowing modes for your lawn. Use Dry mode to vacuum the bedroom and Wet &amp; Dry mode to vacuum and mop hard floors. Put your robot on Quiet mode if, say, you have a meeting, or give the kitchen an extra thorough clean by using Intensive mode. Choose a mowing mode for your lawn to get the perfect looking garden.<br> <br>Set up once. Enjoy spotless floors and lawns every day<br>Once you’ve created a cleaning and mowing plan, clean floors and perfectly mowed lawns are always a tap away. Tap ‘Start’ when you want your robot to begin - every day if you like, and at a time that suits your schedule.<br> <br>Custom clean for specific situations<br>Had friends over and need an extra thorough clean? Or maybe the dog left paw prints in your hallway. Again. Schedule a custom clean and mow that targets specific rooms, areas.<br> <br>Get step-by-step guidance to setup easily<br>From connecting to Wi-Fi to the first clean and mow, we’ll guide you through every step of getting started. You’ll find easy-to-follow instructions and how-to-videos as well.<br> <br>Always have support at your fingertips<br>Have extra questions about the HomeRun app and robot? You’ll find a user manual in the app, answers to FAQs and easy access to Customer Care if need be.<br> <br>Receive progress updates<br>As your robot cleans and mows, you’ll receive in-app updates. See where your robot currently is in your home and what the robot mowing progress is in your garden. Check on its battery levels and, most importantly, get notified as soon as the cleaning run or mowing is done <br> <br>Maintain high performance<br>Get the best performance from your robot by replacing parts on time. Our app lets you know when it’s time to replace parts like filters, mops, and blades, and makes it easy to order them.<br> <br>Keep your data secure<br>Philips adheres to a strict privacy policy. We recommend creating an account to ensure you can save your preferences. If you prefer, you can use the app as a guest. <br> <br>WiFi<br>Philips HomeRun robot vacuum cleaners have dual band Wi-Fi so they are easy to connect to your home Wi-Fi, whether it&#39;s to 2.4 or 5.0GHz. Robot lawn mowers only connect to your 2.4GHz home Wi-Fi.<br> <br>Need help?<br>Visit www.Philips.com to find answers to our most frequently asked questions, or get in touch with our Consumer Care team.",
  "features": null,
  "icon": "https://play-lh.googleusercontent.com/kS54uFFGJLzNx_TA-l4wfoSuoNVJ2zS0z0rPQyL4iyM9RCdqBLy4Jbo8V8meeHP9Wg",
  "screenshots": [
    "https://play-lh.googleusercontent.com/1MAtZKuIurelm1uMBahXcjaMkH9RvvBbvdjhe-v93-tm--EpNHtlJYC7GWedxGjong",
    "https://play-lh.googleusercontent.com/Oysq_GGm3KiB_3KnfGzlO4qj5Bk822csan6BuZuH5Y47-X51-quVAA1NGUAdHYw1Ti0",
    "https://play-lh.googleusercontent.com/oPNtTNMVbxCoFUuBWgvQG50-9FZXIANW34GbRl214UJ1XBY0xcSGlstI4FJ2c0M_1iU",
    "https://play-lh.googleusercontent.com/uXzMmPHh_ncUQiKe6Nv0JF-8tGvYFcStTZxYQkWBC9xPxlSWQSaq-oHGhmWyo9eMvW2N",
    "https://play-lh.googleusercontent.com/Jpp92-soGa-rlmtwIukXGorC1YmXZnSajC0sf9JlGpCPMK0RfCds7HXaek32npK4aA",
    "https://play-lh.googleusercontent.com/s8Fwxpt0yM9gfYCpxEuo1tR0SD91S69GoZNeM7oo3HxgUZ4_TWg7FATcAVZiXQ-7rQ",
    "https://play-lh.googleusercontent.com/A48_2hn1ilNKVAbVdigBSH7HMWfRkcIVAgjl2ehO6ciprqFObDH3TF7osr7nCFX3UuA",
    "https://play-lh.googleusercontent.com/1HRL85H7pJyvH34as5L0hgkzlWv3BHx8sIb-uVADyaeM4rob86kbSQFAIrk8Jgpp0Zk",
    "https://play-lh.googleusercontent.com/WYI8HR6nwwTUO-9o_Fm9UHvSTXStd5id0lNSPkTuaZXE1SKyiDB9PZhrQ7idfTgMyZfn",
    "https://play-lh.googleusercontent.com/RcdwpnTcWEkAvQF30sMAUPgqMriCtMkmRMji25w4wYEfr-4_h5dV4_HT2pLBnCTyTro",
    "https://play-lh.googleusercontent.com/AqQwRrFatDJTCvPM3hC5mAQLT1NqiVYe7W9ziofjz5Yh7ebIXVk9EhUTQeAgD-lly5E",
    "https://play-lh.googleusercontent.com/vppN4uvaIMC_KuFXOGLpLXwbGWon73Z3qwXf4MfoHexx1gplq94L4EDoDDOpjdFQXQs"
  ],
  "video": null,
  "video_image": null,
  "header_image": "https://play-lh.googleusercontent.com/X5zfS3WbggPxTV44BZMJRsb4VzN6tRzptmj6aapg9_vB5wHKedlVZfN5gF3qC3GD6D0",
  "permissions": {
    "Location": [
      "approximate location (network-based)",
      "precise location (GPS and network-based)"
    ],
    "Photos/Media/Files": [
      "modify or delete the contents of your USB storage",
      "read the contents of your USB storage"
    ],
    "Storage": [
      "modify or delete the contents of your USB storage",
      "read the contents of your USB storage"
    ],
    "Camera": [
      "take pictures and videos"
    ],
    "Wi-Fi connection information": [
      "view Wi-Fi connections"
    ],
    "Other": [
      "Google Play license check",
      "access Bluetooth settings",
      "allow Wi-Fi Multicast reception",
      "change network connectivity",
      "connect and disconnect from Wi-Fi",
      "control vibration",
      "full network access",
      "install shortcuts",
      "pair with Bluetooth devices",
      "prevent device from sleeping",
      "reorder running apps",
      "run at startup",
      "set wallpaper",
      "view network connections"
    ],
    "Uncategorized": [
      "receive data from Internet"
    ]
  },
  "reviews_data": null
}